Term4/teorver/lectures/10.tex
% Created 2021-04-17 Sat 15:31
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}
\newcommand{\llb}{\llbracket}
\newcommand{\rrb}{\rrbracket}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\B}{\mathfrak{B}}
\newcommand{\rank}{\mathop{\rm rank}\nolimits}
\newcommand{\const}{\var{const}}
\newcommand{\grad}{\mathop{\rm grad}\nolimits}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother

\newenvironment{rualgo}[1][]
  {\begin{algorithm}[#1]
     \selectlanguage{russian}%
     \floatname{algorithm}{Алгоритм}%
     \renewcommand{\algorithmicif}{{\color{red}\textbf{если}}}%
     \renewcommand{\algorithmicthen}{{\color{red}\textbf{тогда}}}%
     \renewcommand{\algorithmicelse}{{\color{red}\textbf{иначе}}}%
     \renewcommand{\algorithmicend}{{\color{red}\textbf{конец}}}%
     \renewcommand{\algorithmicfor}{{\color{red}\textbf{для}}}%
     \renewcommand{\algorithmicto}{{\color{red}\textbf{до}}}%
     \renewcommand{\algorithmicdo}{{\color{red}\textbf{делать}}}%
     \renewcommand{\algorithmicwhile}{{\color{red}\textbf{пока}}}%
     \renewcommand{\algorithmicrepeat}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicuntil}{{\color{red}\textbf{до тех пор пока}}}%
     \renewcommand{\algorithmicloop}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicnot}{{\color{blue}\textbf{не}}}%
     \renewcommand{\algorithmicand}{{\color{blue}\textbf{и}}}%
     \renewcommand{\algorithmicor}{{\color{blue}\textbf{или}}}%
     \renewcommand{\algorithmicrequire}{{\color{blue}\textbf{Ввод}}}%
     \renewcommand{\algorithmicensure}{{\color{blue}\textbf{Вывод}}}%
     \renewcommand{\algorithmicreturn}{{\color{red}\textbf{Вернуть}}}%
     \renewcommand{\algorithmicrtrue}{{\color{blue}\textbf{истинна}}}%
     \renewcommand{\algorithmicrfalse}{{\color{blue}\textbf{ложь}}}%
     % Set other language requirements
  }
  {\end{algorithm}}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 10}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 10},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Сходимость случайных величин}
\label{sec:orgf3fbc15}
\subsection{Сходимость `почти наверное`}
\label{sec:orga6c7b13}
\begin{definition}
Случайная величина имеет некоторое свойство \textbf{почти наверное}, если: \\
\(p(\text{случайная величина имеет свойство}) = 1\), или \(p(\text{случайная величина не имеет свойство}) = 0\)
\end{definition}
\begin{definition}
\(\{\xi_n\}\) \textbf{сходится почти наверное} к случайной величине \(\xi\), при \(n \to \infty\), если \\
\(p(\omega \in \Omega \big| \xi_n(\omega) \to \xi(\omega)) \to 1\)
\end{definition}
\begin{symb}
\(\xi_n \xrightarrow[n \to \infty]{\text{п.н.}} \xi\)
\end{symb}

\subsection{Сходимость по вероятности}
\label{sec:orgff08684}
\begin{definition}
Последовательность \(\{\xi_n\}\) \textbf{сходится по вероятности} к случайной величине \(\xi\) при \(n \to \infty\), если
\(\forall \varepsilon > 0\ p(|\xi _n - \xi| \ge \varepsilon) \xrightarrow[n \to \infty]{} 0\) или \(p(|\xi_n - \xi| < \varepsilon) \xrightarrow[n \to \infty]{} 1\)
\end{definition}
\begin{remark}
\(\xi_n \xrigharrow{p} \xi \not\!\!\!\implies E\xi_n \to E\xi\)
\end{remark}
\beginproperty
\begin{property}
\(|\xi_n| \le C = \const\) \(\forall n\), тогда \(\xi_n \xrightarrow{p} \xi \implies E\xi_n \to E\xi\)
\end{property}
\begin{property}
Если \(\xi_n \xrightarrow{p} \xi\) и \(\eta_n \xrightarrow{p} \eta\), то \(\xi_n + \eta_n \xrightarrow{p} \xi + \eta\) и \(\xi_n \eta_n \xrightarrow{p} \xi\eta\)
\end{property}
\subsection{Сходимость по функции распределения}
\label{sec:org7702674}
\begin{definition}
Последовательность случайных величин \(\{\xi_n\}\) \textbf{слабо сходится} к случайной величине \(\xi\), если \(F_{\xi_n}(x) \xrightarrow[n \to \infty]{} F_\xi(x)\ \forall x\)
\end{definition}
\begin{symb}
\(\xi_n \rightrightarrows \xi\)
\end{symb}
\beginproperty
\begin{property}
Если \(\xi_n \xrightarrow{p} C\) и \(\eta_n \rightrightarrows \eta\), то \(\xi_n \eta_n \rightrightarrows C\eta\) и \(\xi_n + \eta_n \rightrightarrows \eta + C\)
\end{property}
\subsection{Связь между видами сходимости}
\label{sec:org0771788}
\begin{theorem}
\(\xi_n \xrightarrow{\text{п.н.}} \xi \implies \xi_n \xrigharrow{p} \xi \implies \xi_n \rightrightarrows \xi\)
\end{theorem}
\begin{proof}
\todo
\end{proof}
\begin{theorem}
Если \(\xi \rightrightarrows C\), то \(\xi \xrightarrow{p} C\)
\end{theorem}
\begin{proof}
\todo
\end{proof}
\begin{remark}
В общем случае бессмысленно утверждение \(\xi_n \rightrightarrows \xi \implies \xi_n \xrightarrow{p} \xi\), т.к. совершенно разные случайные величины могут иметь одинаковое распределение
\end{remark}

\begin{theorem}
Для произвольной Борелевской функции \(g(x)\):
\begin{enumerate}
\item \(Eg(x) = \sum_{n = 1}^\infty g(x_n)\cdot p(\xi = x_n)\),  если \(\xi\) --- дискретная случайеая величина
\item \(Eg(x) = \int_{-\infty}^\infty g(x) f_\xi(x) dx\), если \(\xi\) --- абсолютно непрерывная случайная величина
\end{enumerate}
\end{theorem}
\section{Свойство моментов}
\label{sec:org90f8e19}
\beginproperty
\begin{property}
Если случайная величина \(\xi \ge 0\) почти наверное, то \(E\xi \ge 0\)
\end{property}
\begin{proof}
\todo
\end{proof}
\begin{property}
Если \(\xi \ge \eta\) почти наверное, то \(E\xi \ge E\eta\)
\end{property}
\begin{proof}
\(\xi \ge \eta\) почти наверное  \implies \(\xi - \eta \ge 0\) почти наверное \implies \(E(\xi - \eta) = E\xi - E\eta \ge 0 \implies E\xi \ge E\eta\) почти наверное
\end{proof}
\begin{property}
Если \(|\xi| \ge |\eta|\) почти наверное, то \(E|\xi|^k \ge E|\eta|^k\)
\end{property}
\begin{property}
Если существует момент \(n_t\) случайной величины \(\xi\), то существуют и ее моменты меньшего порядка \(s < t\)
\end{property}
\begin{proof}
\todo
\end{proof}
\subsection{Ключевые неравенства}
\label{sec:orgfafab7b}
Далее \(\xi\) --- случайная величина, \(E|\xi| < \infty\) и \(D\xi < \infty\), если оно упоминается в теореме
\begin{theorem}[неравенство Йенсена]
Пусть функция выпукла вниз, тогда для любой случайной величины верно неравенство:
\[ Eg(\xi) \ge g(E\xi) \]
\end{theorem}
\begin{remark}
Для вогнутых функция знак неравенства меняется
\end{remark}
\begin{proof}
\todo
\end{proof}
\begin{corollary}
Если \(E|\xi|^t < \infty\), то \(\forall 0 < s < t\)
\[ \sqrt[s]{E|\xi|^s} \le \sqrt[t]{E|\xi|^t} \]
\end{corollary}
\begin{theorem}[неравентво Маркова]
\[p(|\xi| \ge \varepsilon) \le \frac{E|\xi|}{\varepsilon}\ \forall \varepsilon > 0\]
\end{theorem}
\begin{theorem}[неравентво Чебышева]
\[ p(|\xi - E\xi| \ge \varepsilon) \le \frac{D\xi}{\varepsilon}\ \forall \varepsilon > 0 \]
\end{theorem}

\section{Среднее арифметическое случайных величин}
\label{sec:orgb80163e}
Пусть \(\xi_1, \xi_2, \dots, \xi_n\) --- независимые, одинаково распределенные случайные величины с конечным вторым моментом. Обозначим \(a = E\xi\), \(d = D\xi\), \(\sigma = \sigma_{\xi}\), \(S_n = \xi_1 + \xi_2 + \dots + \xi_n\)
\[ \frac{S_n}{n} = \frac{\xi_1 + \xi_2 + \dots + \xi_n}{n} \]
\[ E \left(\frac{S_n}{n}\right) = \frac{1}{n}(E\xi_1 + \dots + E\xi_n) = \frac{1}{n}(a + \dots + a) = a = E\xi \]
\[ D \left(\frac{S_n}{n}\right) = \frac{1}{n^2}(D\xi_1 + \dots + D\xi_n) = \frac{1}{n^2} \cdot n \cdot d = \frac{d}{n} = \frac{D\xi}{n} \]
\[ \sigma_{S_n} = \frac{\sigma}{\sqrt{n}} \]
\section{Законы больших чисел}
\label{sec:orgafe89cf}
\subsection{Закон больших чисел Чебышева}
\label{sec:orge93c244}
\begin{theorem}
Пусть \(\xi_1, \xi_2, \dots\) --- последовательность незавсимых, одинаково распределенных случайных величин с конечныи вторым моментом, тогда \(\frac{\xi_1 + \dots + \xi_n}{n} \xrightarrow{p} E\xi_1\)
\end{theorem}
\begin{remark}
При доказательстве получили полезное неравенство:
\[ p \left(\left|\frac{S_n}{n} - a \right| \ge C\right) \le \frac{D\xi_1}{n \varepsilon^2} \]
\end{remark}
\subsection{Закон больших чисел Бернулли}
\label{sec:org03c9113}
\begin{theorem}
Пусть \(N_A\) --- число появления события \(A\) в серии из \(N\) независимых экспериментов, \(p = p(A)\) \\
\uline{Тогда} \(\frac{N_A}{n} \xrightarrow{p} p\) 
\end{theorem}
\subsection{Закон больших чисел Хинчина}
\label{sec:org4d2f0d5}
\begin{theorem}
Пусть \(\xi_1, \xi_2, \dots\) --- последовательности независимых, одинаково распределенных случайных величин с конечным первым моментом \(E\xi_1 < \infty\) \\
\uline{Тогда} \[ \frac{\xi_1 + \dots + \xi_n}{n} \xrightarrow{p} E\xi_n \]
\label{org572e196}
\end{theorem}
\subsection{Усиленный закон больших чисел Колмагорова}
\label{sec:orgb199814}
\begin{theorem}
В условиях \hyperref[org572e196]{теоремы Хинчина}
\[ \frac{\xi_1 + \xi_2 + \dots + \xi_1}{n} \xrightarrow{\text{п.н.}} E\xi_n \]
\end{theorem}
\subsection{Закон больших чисел Маркова}
\label{sec:org63f2cb0}
\begin{theorem}
Пусть имеется последовательность случайных величин \(\xi_1, \xi_2, \dots\) с конечными вторыми моментами, при чем \(D(S_n) = o(n^2)\)
\uline{Тогда}
\[ \frac{S_n}{n} \xrightarrow{p} E \left(\frac{S_n}{n}\right) \]
или
\[ \frac{\xi_1 + \dots + \xi_n}{n} - \frac{E\xi_1 + \dots + E\xi_n}{n} \xrightarrow{p} 0 \]
\end{theorem}
\section{Центральная предельная теорема}
\label{sec:org0335bf7}
\begin{theorem}
Пусть \(\xi_1, \xi_2, \dots\) --- , \(0 < D\xi_1 < \infty\) и \(S_n = \sum{i = 1}^n \xi_i\) \\
\uline{Тогда}
\[ \frac{S_n - nE\xi_1}{\sqrt{nD\xi_1}} \rightrightarrows N_{0,1} \]
\end{theorem}
\begin{remark}
\(a = E\xi_1,\ \sigma = \sigma_{\xi_1}\), тогда \(\sigma \left(\frac{S_n}{n}\right) = \frac{\sigma}{\sqrt{n}}\)
\[ \frac{\frac{S_n}{n} - a}{\sigma \left(\frac{S_n}{n}\right)} \rightrightarrows N_{0,1} \]
Т.е. стандартизованное среднее арифметическое слабо сходится к стандартному нормальному распределению
\end{remark}
\end{document}
